app/views/students/_form.html.erb

SELECT "states".* FROM "states"
---
  		<%= f.label :state_id %>
    	<%= f.collection_select :state_id, State.all, :id, :name %>

SELECT "schools".* FROM "schools"
---
  		<%= f.label :school_id %>
    	<%= f.collection_select :school_id, School.all, :id, :name %>

SELECT "faculties".* FROM "faculties"
---
  		<%= f.label :faculty_id %>
    	<%= f.collection_select :faculty_id, Faculty.all, :id, :name %>

SELECT "courses".* FROM "courses"
---
  		<%= f.label :course_id %>
    	<%= f.collection_select :course_id, Course.all, :id, :name %>

SELECT "student_files".* FROM "student_files" WHERE "student_files"."student_id" = 3
---

  	  	<% @student.student_files.each do |file| %>