app/controllers/comments_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "5"]]
---
  def new
    @comment = Comment.new
    @student = Student.find(params[:id])