app/controllers/feedbacks_controller.rb

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @feedback = Feedback.find(params[:id])