app/controllers/feedbacks_controller.rb

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "5"]]
---
  def new
    @feedback = Feedback.new
    @student = Student.find(params[:id])

INSERT INTO "feedbacks" ("answers", "application_support_comment", "application_support_status_id", "created_at", "extra_note", "read_confirmation", "recommandation_level", "school_id", "student_id", "support_student", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @feedback = Feedback.new(params[:feedback])
    if @feedback.save

SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."id" = ? LIMIT 1  [["id", "3"]]
---
  def edit
    @feedback = Feedback.find(params[:id])