app/controllers/students_controller.rb

INSERT INTO "students" ("address1", "address2", "completed", "confirm_email", "course_id", "created_at", "date_of_birth", "declaration1", "declaration2", "declaration3", "declaration4", "email", "faculty_id", "first_name", "last_name", "mobile", "note1", "note2", "note3", "parent_mobile", "parent_name", "parent_phone", "phone", "post_code", "school_id", "state_id", "suburb", "title", "uac_number", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "student_files" ("name", "student_id") VALUES (?, ?)  [["name", "claim_fuel.doc21"], ["student_id", 21]]
---
  def create
    if verify_recaptcha
      @student = Student.new(params[:student])
      if @student.save
        3.times do |i|
          unless params["file"]["#{i}"].nil?
            tmp = params["file"]["#{i}"].tempfile
            file_name = params["file"]["#{i}"].original_filename
            file = File.join("public/data", "#{file_name}#{@student.id}")
            StudentFile.create(:name => "#{file_name}#{@student.id}", :student_id => @student.id)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "students" SET "first_name" = 'samantha', "last_name" = 'gamage', "parent_name" = 'gamage', "email" = 'samantha@gmail.com', "address1" = 'address', "suburb" = 'suburb', "updated_at" = '2012-07-18 16:58:12.977583' WHERE "students"."id" = 6
---
  def update
    @student = Student.find(params[:id])

    respond_to do |format|
      if @student.update_attributes(params[:student])